Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/cohabiting_couples/property_rights_and_unmarried_couples.html.txt.tmx
Source language: en
Languages: ga

source: Property rights of cohabiting couples
ga: Cearta maoine lánúineacha comhchónaithe

source: Buying a home together
ga: Ag ceannach tí le chéile

source: If you are buying (or thinking about buying) a home with your partner, you should consider in advance which is the best home ownership option for you
ga: Má tá tú neamhphósta agus go bhfuil tú ag ceannach tí (nó ag smaoineamh faoina cheannach) le do pháirtí, ba chóir duit staidéar a dhéanamh roimhré ar an rogha úinéireachta tí is fearr duitse

source: In Ireland, joint ownership of property for cohabiting couples can be held in one of two ways;
ga: In Éirinn, is féidir comhúinéireacht de mhaoin do lánúineacha comhchónaithe a bheith i seilbh duine ar cheann amháin de dhá bhealach:

source: Considering which is the best option for you, means being prepared for what you wish to happen in in the event of the death of either partner, or the breakup of your relationship
ga: Smaoineamh ar a bhfuil an rogha is fearr leat, ciallaíonn á n-ullmhú ar cad is mian leat a tharlóidh i gcás bhás an ceachtar páirtí, nó deireadh na bliana do chaidrimh

source: This means the whole property is owned by two people with the intention that, when one dies, the other person will automatically own all of the property
ga: Ciallaíonn sé seo go bhfuil an mhaoin uile faoi úinéireacht beirte leis an rún, nuair a bhásaíonn duine, go mbeidh an duine eile in úinéireacht na maoine uile go huathoibríoch

source: In situations where one person has paid for the property, the other person may not get 50% of the proceeds if the house is sold
ga: I gcásanna inar íoc duine amháin as an maoin, ní gá go bhfaighfidh an duine eile 50% den fháltas má dhíoltar an teach

source: In situations such as this, you need to check your situation with a solicitor
ga: I gcásanna den chineál seo, ní mór duit do sheasamh a sheiceáil le haturnae

source: This means the property is owned in defined shares by two people
ga: Ciallaíonn sé seo go bhfuil úinéireacht i scaireanna sainithe ag beirt ar an maoin

source: For example, 50/50, 75/25, 60/40, etc
ga: Mar shampla, 50/50, 75/25, 60/40, srl

source: Each person can leave their share of the property to whomever they wish
ga: Is féidir le gach duine a scair den mhaoin a fhágáil le cibé duine is mian leo

source: (They may leave their share to their partner for example, but they must make a will stating this fact)
ga: (Is féidir leo a scair a fhágáil ag a bpáirtí mar shampla, ach ní mór dóibh uacht a dhéanamh á mhaíomh seo)

source: If no will is made, the share becomes part of the estate of the deceased partner and the other partner does not have any automatic right to the share
ga: Mura ndéantar aon uacht, bíonn an scair mar chuid d'eastát an pháirtí éagtha, agus ní bhíonn aon cheart ag an bpáirtí neamhphósta an scair a fháil go huathoibríoch

source: Instead, the family (or even a separated spouse or civil partner) of the deceased person can claim this share
ga: Ina ionad sin, is féidir le clann (nó fiú céile scartha nó páirtí sibhialta) an duine éagtha an scair seo a éileamh

source: You can read more about dealing with a deceased person's estate here
ga: Is féidir leat tuilleadh a léamh faoi láimhseáil eastáit dhuine éagtha anseo

source: The Family Home Protection Act 1976 gives a spouse the right to veto any sale or lease of the family home by the other spouse
ga: Tugann an tAcht um Chosaint Tí an Teaghlaigh 1976 ceart don chéile crosadh a chur ar an gcéile eile teach an teaghlaigh a dhíol ná a ligean ar léas

source: In order to sell or lease the family home, the written consent of both spouses must first be obtained
ga: Caithfear comhthoiliú i scríbhinn an dá chéile a fháil ar dtús sular féidir teach an teaghlaigh a dhíol ná a ligean ar léas

source: Under Part 4 of the Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010 similar provisions apply to the shared home of a couple in a civil partnership
ga: Faoi Chuid 4 de chuid na Comhpháirtíochta um Chearta Sibhialta agus Áirithe agus Oibleagáidí Comhchónaitheoirí Acht 2010 forálacha den chineál céanna iarratas a dhéanamh chun an bhaile roinnte de lánúin i gcomhpháirtíocht shibhialta

source: These provisions do not apply to cohabiting couples. If you are living with your partner in his/her house, there is no need for your partner to obtain your written consent before he or she can sell or lease the house
ga: Ní bhaineann na forálacha sin le lánúineacha comhchónaithe, agus má tá tú i do chónaí le do pháirtí ina t(h)each, níl aon ghá do do pháirtí do chomhthoiliú i scríbhinn a fháil sular féidir leis nó léi an teach a dhíol nó a ligean ar cíos

source: The question of whether or not you may be allocated local authority housing is generally based on your need for housing and whether you could afford to pay for your own accommodation
ga: Tá ceist do theidlíochta ar thithíocht rialtais áitiúil bunaithe go ginearálta ar do riachtanais tithíochta agus an bhfuil sé d'acmhainn agat íoc as do chóiríocht féin

source: Cohabiting couples may apply to be allocated local authority housing
ga: Is féidir le lánúineacha comhchónaithe iarratas a dhéanamh le haghaidh tithíochta údaráis áitiúil - níl aon cheist faoi stádas pósta na n-iarratasóirí i bhformhór foirmeacha iarratais na n-údarás áitiúil i gcomhair tithíochta

source: Usually when married couples are allocated local authority accommodation, the lease is in both their names as joint-tenants
ga: Is iondúil nuair a fhaigheann lánúineacha pósta cóiríocht rialtais áitiúil, bíonn an léas in ainm na beirte acu mar chomhthionóntaí

source: This means that if one spouse dies or leaves, the remaining spouse can take over the lease
ga: Ciallaíonn sé seo má fhaigheann céile amháin bás nó má imíonn sé/sí, is féidir leis an gcéile eile leanúint ar aghaidh leis an léas

source: It is also possible for cohabiting couples to apply for the allocation of a house to be held in joint-tenancy
ga: Is féidir le lánúineacha comhchónaithe iarratas a dhéanamh le haghaidh teach a fháil a bheidh ina seilbh mar chomhthionóntacht

source: If you move in to a local authority house where your partner is already the sole tenant, you may apply for joint tenancy after two years
ga: Má aistríonn tú chuig teach de chuid údaráis áitiúil, mar a bhfuil do pháirtí mar thionónta aonair, is féidir leat iarratas a dhéanamh le haghaidh comhthionóntachta tar éis dhá bhliain

source: Private rented accommodation and the private housing market
ga: Cóiríocht phríobháideach ar cíos agus an margadh tithíochta príobháidí

source: Under the Equal Status Act 2000 and the Equality Act 2004, a landlord cannot refuse to rent accommodation to you because of your civil status
ga: Faoin Acht um Stádas Comhionann 2000 agus an tAcht um Chomhionannas 2004 (pdf), ní féidir le tiarna talún cóiríocht ar cíos a dhiúltú duit mar gheall ar do stádas pósta

source: He or she also cannot discriminate against you in relation to any of the services or amenities relating to the accommodation or end your lease simply because you are not married or in a civil partnership
ga: Ní féidir leis nó léi leatrom a dhéanamh ort maidir le haon cheann de na seirbhísí ná áiseanna a bhaineann leis an gcóiríocht ná deireadh a chur le do léas mar nach bhfuil tú pósta nó i pháirtnéireacht shibhialta

source: Cohabiting couples are entitled to buy private houses and lending institutions will not refuse to give you a mortgage simply because you are cohabiting
ga: Tá lánúineacha comhchónaithe i dteideal tithe príobháideacha a cheannach, agus ní dhiúltódh institiúidí iasachta morgáistea thabhairt duit ar bhunús do chúinsí pósta

source: The main concern of lending institutions is your ability to repay the loan
ga: Is é an t-údar imní is mó a bhíonn ar institiúidí iasachta ná d'ábaltacht an iasacht a aisíoc

source: If you feel that you and your partner have been discriminated against in the area of housing, you should bring your complaint to the Irish Human Rights and Equality Commission within two months of the discriminatory act or decision
ga: Má cheapann tú go ndearnadh leatrom ort féin nó ar do pháirtí ó thaobh tithíochta de, ba chóir duit do ghearán a dhéanamh leis an Coimisiún na hÉireann um Chearta an Duine agus Comhionannas, laistigh de dhá mhí ón am ar tharla an gníomh nó cinneadh leatromach

source: If you are buying or considering buying property with your partner, you should seek legal advice on the best option for you
ga: Má tá tú ag ceannach nó ag smaoineamh faoi cheannach maoine le do pháirtí, ba chóir duit comhairle dlí a lorg ar an rogha ab fhearr duitse
